<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
cursor = connection.cursor()

query_3_1 = f'''SELECT
                COUNT(*) AS vacancies_count
                FROM vacancies
'''

In [5]:
# результат запроса
cursor.execute(query_3_1)
result = cursor.fetchone()
print("Количество вакансий:", result[0])

Количество вакансий: 49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''SELECT
                COUNT(*) AS employers_count
                FROM employers
'''

In [7]:
# результат запроса
cursor.execute(query_3_2)
result = cursor.fetchone()
print("Количество работодателей:", result[0])

Количество работодателей: 23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''SELECT
                COUNT(*)
                FROM areas
'''

In [9]:
# результат запроса
cursor.execute(query_3_3)
result = cursor.fetchone()
print("Количество регионов:", result[0])

Количество регионов: 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''SELECT
                COUNT(*)
                FROM industries
'''

In [11]:
# результат запроса
cursor.execute(query_3_4)
result = cursor.fetchone()
print("Количество сфер деятельности:", result[0])

Количество сфер деятельности: 294

***

In [12]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''SELECT
                COUNT(*) as cnt,
                a.name as area
                FROM vacancies v
                JOIN areas a ON v.area_id = a.id
                GROUP BY area
                ORDER BY cnt DESC
                LIMIT 5
'''

In [14]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''SELECT
                COUNT(*)
                FROM vacancies
                WHERE salary_from IS NOT NULL or salary_to IS NOT NULL
'''

In [16]:
# результат запроса
cursor.execute(query_4_2)
result = cursor.fetchone()
print("Количество вакансий, где указана зарплата:", result[0])

Количество вакансий, где указана зарплата: 24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
# текст запроса
query_4_3 = f'''SELECT
                'AVG_FROM' AS Name,
                ROUND(AVG(salary_from)) AS Value
                FROM vacancies
                UNION
                SELECT
                'AVG_TO' AS Name,
                ROUND(AVG(salary_to)) AS Value
                FROM vacancies
'''

In [18]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

       name     value
0  AVG_FROM   71065.0
1    AVG_TO  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''SELECT
                DISTINCT(schedule, employment) AS Combination,
                COUNT(*) AS Count
                FROM vacancies
                GROUP BY Combination
                ORDER BY Count DESC
                OFFSET 1 LIMIT 1
'''

In [20]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\1260414382.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

                               combination  count
0  ("Удаленная работа","Полная занятость")   7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''SELECT
                experience,
                COUNT(*) as count
                FROM vacancies
                GROUP BY experience
                ORDER BY count ASC
'''

In [22]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [23]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
# текст запроса
query_5_1 = f'''(SELECT
                e.name AS Employee,
                COUNT(v.id) AS Count
                FROM employers e
                JOIN vacancies v ON v.employer_id = e.id
                GROUP BY Employee 
                ORDER BY Count DESC
                LIMIT 1)
                UNION
                (SELECT
                e.name AS Employee,
                COUNT(v.id) AS Count
                FROM employers e
                JOIN vacancies v ON v.employer_id = e.id
                GROUP BY Employee
                ORDER BY Count DESC
                OFFSET 4 LIMIT 1)
'''

In [25]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

        employee  count
0  Газпром нефть    331
1         Яндекс   1933

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса
query_5_2 = f'''SELECT
                a.name AS Area,
                COUNT(e.id) AS Emp,
                COUNT(v.id) AS Vac
                FROM areas a
                LEFT JOIN vacancies v ON v.area_id = a.id
                LEFT JOIN employers e ON e.area = a.id
                WHERE v.id IS NULL
                GROUP BY a.name
                ORDER BY 2 DESC
'''

In [27]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                               area  emp  vac
0                            Россия  410    0
1                         Казахстан  207    0
2                Московская область   75    0
3                Краснодарский край   19    0
4                          Беларусь   18    0
..                              ...  ...  ...
588                        Кувандык    0    0
589                        Куйбышев    0    0
590  Куйбышево (Ростовская область)    0    0
591                        Култаево    0    0
592                        Кульсары    0    0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_5_3 = f'''SELECT
                e.name AS Employer,
                COUNT(DISTINCT(v.area_id)) AS Areas
                FROM employers e
                JOIN vacancies v ON e.id = v.employer_id
                GROUP BY e.name
                ORDER BY COUNT(v.area_id) DESC 
'''

In [29]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                                    employer  areas
0                                     Яндекс    181
1                                 Ростелеком    152
2                                   Тинькофф     43
3                                       СБЕР     24
4                              Газпром нефть     24
...                                      ...    ...
14761             ПСБ Инновации и Инвестиции      1
14762                             ПСЗ Янтарь      1
14763                                    ПСК      1
14764  Псковский завод механических приводов      1
14765                     ПСК ТатЭнергоСтрой      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_5_4 = f'''SELECT
                COUNT(*)
                FROM employers e
                LEFT JOIN employers_industries ei ON ei.employer_id = e.id
                WHERE ei.industry_id IS NULL
             
'''

In [31]:
# результат запроса
cursor.execute(query_5_4)
result = cursor.fetchone()
print("Количество работодателей без сферы деятельности:", result[0])

Количество работодателей без сферы деятельности: 8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [32]:
# текст запроса
query_5_5 = f'''SELECT
                e.name AS company,
                COUNT(ei.industry_id)
                FROM employers e
                JOIN employers_industries ei ON e.id = ei.employer_id
                GROUP BY e.name
                HAVING COUNT(ei.industry_id) = 4 
                ORDER BY e.name        
                OFFSET 2 LIMIT 1
'''

In [33]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

  company  count
0    2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [34]:
# текст запроса
query_5_6 = f'''SELECT 
                COUNT(e.name)
                FROM employers e
                JOIN employers_industries ei ON ei.employer_id = e.id
                JOIN industries i ON ei.industry_id = i.id
                GROUP BY i.name
                HAVING i.name LIKE 'Разработка программного обеспечения'
'''

In [35]:
# результат запроса
cursor.execute(query_5_6)
result = cursor.fetchone()
print("Количество работодателей в сфере разработки программного обеспечения:", result[0])

Количество работодателей в сфере разработки программного обеспечения: 3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
# код для получения списка городов-милионников
import requests
from bs4 import BeautifulSoup
import pandas as pd

url = "https://ru.wikipedia.org/wiki/Города-миллионеры_России"
response = requests.get(url)
soup = BeautifulSoup(response.content, "html.parser")

table = soup.find("span", {"id": "Список_городов-миллионеров"}).find_next("table")

data = {
    "Name": []
}

for row in table.find_all("tr")[1:]:
    columns = row.find_all("td")
    city_name = columns[1].text.strip()

    data["Name"].append(city_name)

kk_city = pd.DataFrame(data)

print(kk_city)

               Name
0            Москва
1   Санкт-Петербург
2       Новосибирск
3      Екатеринбург
4            Казань
5   Нижний Новгород
6        Красноярск
7         Челябинск
8            Самара
9               Уфа
10   Ростов-на-Дону
11        Краснодар
12             Омск
13          Воронеж
14            Пермь
15        Волгоград

In [37]:
# текст запроса
cities = tuple(kk_city['Name'])

query_5_7 = f'''SELECT 
                a.name,
                COUNT(v.id) AS cnt
                FROM vacancies v
                LEFT JOIN employers e on v.employer_id = e.id
                LEFT JOIN areas a on a.id = v.area_id
                WHERE e.name = 'Яндекс'
                AND a.name in {cities}
                GROUP BY a.name
                UNION ALL
                SELECT
                'total' AS name,
                SUM(1) AS cnt
                FROM vacancies v
                LEFT JOIN employers e on v.employer_id = e.id
                LEFT JOIN areas a on a.id = v.area_id
                WHERE e.name = 'Яндекс'
                AND a.name in {cities}
'''

In [38]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0             total  485
1         Волгоград   24
2           Воронеж   32
3      Екатеринбург   39
4            Казань   25
5         Краснодар   30
6        Красноярск   23
7            Москва   54
8   Нижний Новгород   36
9       Новосибирск   35
10             Омск   21
11            Пермь   25
12   Ростов-на-Дону   25
13           Самара   26
14  Санкт-Петербург   42
15              Уфа   26
16        Челябинск   22

***

In [39]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [40]:
# текст запроса
query_6_1 = f'''SELECT
                COUNT(*)
                FROM vacancies v
                WHERE LOWER(v.name) LIKE '%data%' OR LOWER(v.name) LIKE '%данн%'
'''

In [41]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
# текст запроса
query_6_2 = f'''SELECT
                COUNT(v.name)                
                FROM vacancies v
                WHERE
                    ((name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
                    OR ((name LIKE '%ML%')
                    AND (name NOT LIKE '%HTML%'))
                    OR (name ILIKE '%machine learning%')
                    OR (name ILIKE '%машинн%обучен%')
                    AND (key_skills IS NOT NULL))
                    
                    AND (v.name ILIKE '%junior%'
                    OR v.experience ILIKE '%Нет опыта%'
                    OR v.employment ILIKE '%Стажировка%')
'''

In [43]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
# текст запроса
query_6_3 = f'''SELECT 
                COUNT(name)                
                FROM vacancies
                WHERE
                    (name ILIKE '%data scientist%' 
                    OR name ILIKE '%data science%' 
                    OR name ILIKE '%исследователь данных%' 
                    OR (name LIKE '%ML%' 
                    AND name NOT LIKE '%HTML%') 
                    OR name ILIKE '%machine learning%' 
                    OR name ILIKE '%машинн%обучен%') 
                    AND (key_skills ILIKE '%SQL%' 
                    OR key_skills ILIKE '%postgre%')
'''

In [45]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [46]:
# текст запроса
query_6_4 = f'''SELECT 
                COUNT(name)                
                FROM vacancies
                WHERE
                    (name ILIKE '%data scientist%' 
                    OR name ILIKE '%data science%' 
                    OR name ILIKE '%исследователь данных%' 
                    OR (name LIKE '%ML%' 
                    AND name NOT LIKE '%HTML%') 
                    OR name ILIKE '%machine learning%' 
                    OR name ILIKE '%машинн%обучен%') 
                    AND (key_skills ILIKE '%python%')
'''

In [47]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [48]:
# текст запроса
query_6_5 = f'''SELECT 
                    ROUND(AVG(LENGTH(key_skills) - LENGTH(REPLACE(key_skills, CHR(9), '')) + 1),2)                
                FROM vacancies
                WHERE
                    (name ILIKE '%data scientist%' 
                    OR name ILIKE '%data science%' 
                    OR name ILIKE '%исследователь данных%' 
                    OR (name LIKE '%ML%' 
                    AND name NOT LIKE '%HTML%') 
                    OR name ILIKE '%machine learning%' 
                    OR name ILIKE '%машинн%обучен%')
'''

In [49]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [50]:
# текст запроса
query_6_6 = f'''SELECT 
                experience,
                    ROUND(AVG(
                        CASE 
                            WHEN salary_to IS NOT NULL AND salary_from IS NOT NULL THEN (salary_to + salary_from) / 2
                            WHEN salary_to IS NOT NULL THEN salary_to
                            ELSE salary_from
                        END
                    )) AS average_salary
                FROM vacancies
                WHERE 
                    (name ILIKE '%data scientist%' 
                    OR name ILIKE '%data science%' 
                    OR name ILIKE '%исследователь данных%' 
                    OR (name LIKE '%ML%' 
                    AND name NOT LIKE '%HTML%') 
                    OR name ILIKE '%machine learning%' 
                    OR name ILIKE '%машинн%обучен%')
                    AND (experience ILIKE '%От 3 до 6 лет%')
                    AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
                GROUP BY experience
                ORDER BY experience
'''

In [51]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\TURBA PC\AppData\Local\Temp\ipykernel_11928\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

      experience  average_salary
0  От 3 до 6 лет        243115.0

***

In [52]:
# выводы по предметному анализу

# Общий вывод по проекту

In [53]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования